## Introduction to Pandas - DataFrame & Series

In [1]:
import pandas as pd

### Series
''' Pandas series is one dimensional array-obj that can hold any data type.
it is similar to a column in a table.'''

In [3]:
import pandas as pd
data = pd.Series([23,34,46,57,61])
print(data)
print(type(data))

0    23
1    34
2    46
3    57
4    61
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# Series from Dictionary
data = pd.Series({'a': 5,'b': 8,'c': 2, 'd': 7})
print(data)

a    5
b    8
c    2
d    7
dtype: int64

In [11]:
data = [31,33,35,37,39]
idx = ['a','c','e','g','i']
pd.Series(data,idx)

a    31
c    33
e    35
g    37
i    39
dtype: int64

### DataFrame
''' DataFrame is a 2D mutable heterogenous tabular data
It can have multiple rows & cols
'''

In [15]:
# DataFrame from dictrionary
import pandas as pd
data = {
    'Name' : ['Lana','Abel','Bella'],
    'Age' : [30,31,25],
    'Place' : ['Malibu','Bay-Area','Hollywood']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      Place
0   Lana   30     Malibu
1   Abel   31   Bay-Area
2  Bella   25  Hollywood
<class 'pandas.core.frame.DataFrame'>

In [16]:
import numpy as np
n = np.array(df)
print(n)

[['Lana' 30 'Malibu']
 ['Abel' 31 'Bay-Area']
 ['Bella' 25 'Hollywood']]

In [19]:
# Create a DataFrame from list of dictionaries
data = [
    {'Name':'Lana','Age':30,'Place':'Malibu'},
    {'Name':'Judy','Age':23,'Place':'Bay-Area'},
    {'Name':'Natasha','Age':20,'Place':'Pasadena'},
    {'Name':'Sieera','Age':31,'Place':'Silicon-Valley'},
    {'Name':'Heidy','Age':27,'Place':'Hollywood'}
]
df = pd.DataFrame(data)
print(df)

      Name  Age           Place
0     Lana   30          Malibu
1     Judy   23        Bay-Area
2  Natasha   20        Pasadena
3   Sieera   31  Silicon-Valley
4    Heidy   27       Hollywood

In [27]:
# Access elements
data = [
    {'Name':'Lana','Age':30,'Place':'Malibu'},
    {'Name':'Judy','Age':23,'Place':'Bay-Area'},
    {'Name':'Natasha','Age':20,'Place':'Pasadena'},
    {'Name':'Sieera','Age':31,'Place':'Silicon-Valley'},
    {'Name':'Heidy','Age':27,'Place':'Hollywood'}
]
df = pd.DataFrame(data)
df

      Name  Age           Place
0     Lana   30          Malibu
1     Judy   23        Bay-Area
2  Natasha   20        Pasadena
3   Sieera   31  Silicon-Valley
4    Heidy   27       Hollywood

In [ ]:
# df['Name']
# type(df['Name'])
# df.loc[3]
# df.iloc[2][2]

C:\Users\ehonf.FAIZAHS-X14\AppData\Local\Temp\ipykernel_28744\2383548318.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[2][2]

'Pasadena'

### How to read csv files in pandas

In [24]:
df1 = pd.read_csv('sales_data.csv')
df1.head(5) # Top 5 elements of the file
# remove print for an organized data visualization

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North